format long g
n=input("Input the question number:");

switch n
    
    case 1
        %% 数学建模习题1.1
        c=[-3,1,1]';
        A=[1,-2,1;4,-1,-2];
        b=[11;-3];
        Aeq=[-2,0,1];
        beq=1;
        lb=[0 0 0]';
        ub=[inf ,inf ,inf]';
        [x,fval] = linprog(c,A,b,Aeq,beq,lb,ub)
        fval=-fval
        
    case 2
        %% 数学建模习题1.2
        Aeq=[1,-1,-1,1;1,-1,1,-3;1,-1,-2,3];
        beq=[0,1,-1/2]';
        m=inf;
        for i=1:2
            for j=1:2
                for k=1:2
                    for s=1:2
                        c=[(-1)^i,2*(-1)^j,3*(-1)^k,4*(-1)^s]'
                        lb=[f_lscale(i),f_lscale(j),f_lscale(k),f_lscale(s)]';
                        ub=[f_uscale(i),f_uscale(j),f_uscale(k),f_uscale(s)]';
                        [x,fval]=linprog(c,[],[],Aeq,beq,lb,ub);
                        if ~isempty(fval)
                        m=min(m,fval);
                        end
                    end
                end
            end
        end
        m
        
    case 3
        %% 数学建模习题1.3
        c=[1-300*5/6000 1-321*7/10000 -250*6/4000 -783*4/7000 -200*7/4000 -300*10/6000 -321*9/10000 1.65-250*8/4000 2.3-321*12/10000-783*11/7000]';
        c=-c;
        A=[5 0 0 0 0 10 0 0 0;
            0 7 0 0 0 0 9 0 12;
            0 0 6 0 0 0 0 8 0;
            0 0 0 4 0 0 0 0 11;
            0 0 0 0 7 0 0 0 0 ];
        b=[6000,10000,4000,7000,4000]';
        Aeq=[1 1 -1 -1 -1 0 0 0 0;
            0 0 0 0 0 1 1 -1 0];
        beq=[0,0]';
        lb=[0,0,0,0,0,0,0,0,0,]';
        [x,fval]=linprog(c,A,b,Aeq,beq,lb,[]);
        x
        fval=-fval
        
    case 4
        %% 数学建模习题1.5
        clear;clc
        c=-[0.15,0.15,0.15,0.15,0.25,0.4,0.06,0.06,0.06,0.06,0.06]';
        A=[1,0,0,0,0,0,1,0,0,0,0;
            1,1,0,0,0,1,-0.06,1,0,0,0;
            -0.15,1,1,0,1,1,-0.06,-0.06,1,0,0;
            -0.15,-0.15,1,1,1,1,-0.06,-0.06,-0.06,1,0;
            -0.15,-0.15,-0.15,1,1,1,-0.06,-0.06,-0.06,-0.06,1;
            0,0,0,0,1,0,0,0,0,0,0;
            0,0,0,0,0,1,0,0,0,0,0];
        b=10*ones(7,1);
        b(6)=4;
        b(7)=3;
        lb=zeros(11,1);
        [x,fval]=linprog(c,A,b,[],[],lb,[]);
        x
        fval=-fval+10
        
    case 5
        %% 数学建模习题1.6
        clear;clc
        c=-[4,-5,12,3,16,7]';
        A=zeros(11,6);
        A(1,1:2)=1;
        A(2,3:4)=1;
        A(3,5:6)=1;
        A(4,1:2:5)=-1;
        A(5,2:2:6)=-1;
        A(6,[1,3,5])=-[1,-1,-1];
        A(7,[1,3,5])=-[-1,3,-1];
        A(8,[1,3,5])=[-1,-1,9];
        A(9,[2,4,6])=[3,-2,-2];
        A(9,[2,4,6])=[-2,3,-2];
        A(9,[2,4,6])=-[-3,-3,17];
        b=zeros(11,1);
        b(1:5)=[600,750,625,600,800];
        lb=zeros(6,1)';
        [x,fval]=linprog(c,A,b,[],[],lb);
        x
        fval=-fval
        
    case 6
        %% 数学建模习题1.7
        clear;clc
        c=[-1,zeros(1,100)];
        a=fix(10*rand(100,150));
        A=[ones(150,1),zeros(150,100)];
        for i=1:150
            A(i,2:end)=-a(:,i)';
        end
        b=zeros(150,1);
        Aeq=ones(1,101);
        Aeq(1)=0;
        beq=1;
        lb=zeros(101,1);
        [x,fval]=linprog(c,A,b,Aeq,beq,lb);
        fval=-fval
    case 7
        %% 数学建模习题1.8
        
    case 9
        %% 数学建模习题1.9
        clear;clc
        
end
